/*
1409. Два бандита
Ограничение времени: 1.0 секунды
Ограничение памяти: 64 МБ
Бандиты Гарри и Ларри отдыхали на природе. Решив пострелять, они выставили на бревно несколько банок из-под пива (не больше 10). Гарри начал простреливать банки по порядку, начиная с самой левой, Ларри — с самой правой. В какой-то момент получилось так, что они одновременно прострелили одну и ту же последнюю банку.
Гарри возмутился и сказал, что Ларри должен ему кучу денег за то, что тот лишил его удовольствия прострелить несколько банок. В ответ Ларри сказал, что Гарри должен ему еще больше денег по тем же причинам. Они стали спорить кто кому сколько должен, но никто из них не помнил сколько банок было в начале, а искать простреленные банки по всей округе было неохота. Каждый из них помнил только, сколько банок прострелил он сам.
Определите по этим данным, сколько банок не прострелил Гарри и сколько банок не прострелил Ларри.
Исходные данные
В единственной строке записано 2 числа — количество банок, простреленных Гарри и Ларри соответственно.
Результат
Выведите 2 числа — количество банок, не простреленных Гарри и Ларри соответственно.*/
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace _1409
{
    class Program
    {
        static void Main(string[] args)
        {
            string[] str = Console.ReadLine().Split(' ');
            int[] tins = new int[str.Length];
            tins[0] = Convert.ToInt32(str[0]);
            tins[1] = Convert.ToInt32(str[1]);

            Console.Write(tins[1] - 1);
            Console.Write(' ');
            Console.Write(tins[0] - 1);
        }
    }
}